tutorialsDyM/2DRotor/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------


runApplication blockMesh

# Select cellSets
runApplication -s 1 topoSet

runApplication subsetMesh box -patch hole -overwrite

cp -r 0_org 0

# Use cellSets to write zoneID
runApplication setFields


#funkySetFields -time 0

overSedDymFoam_rbgh > log &
